Ipsitakoley/tm4c129-canbus/sae-benchmark/can-sae-vc/timers.c
//*****************************************************************************
//
// timers.c - Timers example.
// can.c - Simple CAN example.
//
// Copyright (c) 2013-2017 Texas Instruments Incorporated.  All rights reserved.
// Software License Agreement
// 
// Texas Instruments (TI) is supplying this software for use solely and
// exclusively on TI's microcontroller products. The software is owned by
// TI and/or its suppliers, and is protected under applicable copyright
// laws. You may not combine this software with "viral" open-source
// software in order to form a larger program.
// 
// THIS SOFTWARE IS PROVIDED "AS IS" AND WITH ALL FAULTS.
// NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING, BUT
// NOT LIMITED TO, IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
// A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE. TI SHALL NOT, UNDER ANY
// CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL, OR CONSEQUENTIAL
// DAMAGES, FOR ANY REASON WHATSOEVER.
// 
// This is part of revision 2.1.4.178 of the EK-TM4C129EXL Firmware Package.
// This is part of revision 2.1.4.178 of the DK-TM4C123G Firmware Package.
//
//*****************************************************************************

#include <stdint.h>
#include <stdbool.h>
#include "inc/hw_can.h"
#include "inc/hw_ints.h"
#include "inc/hw_memmap.h"
#include "inc/hw_types.h"
#include "driverlib/debug.h"
#include "driverlib/fpu.h"
#include "driverlib/can.h"
#include "driverlib/gpio.h"
#include "driverlib/interrupt.h"
#include "driverlib/pin_map.h"
#include "driverlib/rom.h"
#include "driverlib/rom_map.h"
#include "driverlib/sysctl.h"
#include "driverlib/timer.h"
#include "driverlib/uart.h"
#include "utils/uartstdio.h"


//*****************************************************************************
//
// A counter that keeps track of the number of times the TX & RX interrupt has
// occurred, which should match the number of messages that were transmitted /
// received.
//
//*****************************************************************************
volatile uint32_t g_ui32RXMsgCount = 0;
volatile uint32_t g_ui32TXMsgCount = 0;
volatile uint32_t g_ui32TXHighMsgCount = 0;
volatile uint32_t g_ui32TXMidMsgCount = 0;

volatile uint32_t g_ui32TXCount = 0;
volatile uint32_t g_ui32RXCount = 0;

volatile uint32_t g_target_id = 0;

//*****************************************************************************
//
// A flag for the interrupt handler to indicate that a message was received.
//
//*****************************************************************************
volatile bool g_bRXFlag = 0;
volatile bool g_bTXFlag = 0;
volatile bool g_bTXFlag_5 = 0;
volatile bool g_bTXFlag_5A1 = 0;

volatile bool g_tick = false;

volatile uint8_t g_sync = 0;
volatile uint8_t g_reset = 0;

volatile uint8_t g_msg_since_idle = 0;
volatile uint8_t g_sync_since_idle = 0;


/* experimental controls */

#define VERBOSE

//#define SEND_EXTRA 2


//#define SEND_RESET


//#define ATTACK

#if defined(ATTACK)
#define ATTACK_LATENCY (1)

#define TRANSITIVE_ATTACK
#define TARGET_ID_2 (0xA3)
#define PRECEDED_ID_2 (0xA2)

// set SKIP_ATTACK to 2 for 1 skip, 3 to skip 2, etc.
#define SKIP_ATTACK (5)
#define SKIP_ATTACK_2 (1)
volatile uint8_t g_skip_attack = SKIP_ATTACK;

#define RECESSIVE_ATTACK
// TODO
/* Synchronization control */
#define SYNC_0PHASE
//#define SYNC_PERIOD

/* Retransmission control */
//#define RETRANSMIT
//#define DISABLE_AUTO
//#define DISABLE_ABORT_TX_ERROR

/* Need to enable this instead of rxpm since the attacker transmits the PM */
#define DISABLE_ABORT_TX_PRECEDED
//#define DISABLE_ABORT_RX_PRECEDED

#endif // ATTACK


//*****************************************************************************
//
// A global to keep track of the error flags that have been thrown so they may
// be processed. This is necessary because reading the error register clears
// the flags, so it is necessary to save them somewhere for processing.
//
//*****************************************************************************
volatile uint32_t g_ui32ErrFlag = 0;

//*****************************************************************************
//
// CAN message Objects for data being sent / received
//
//*****************************************************************************
tCANMsgObject g_sCAN0RxMessage;

tCANMsgObject g_sCAN0TxMessage_5;

#if defined(ATTACK)
tCANMsgObject g_sCAN0TxMessage_5A1;
#endif

#if defined(SEND_EXTRA)
tCANMsgObject g_sCAN0TxMessage_5C1;
tCANMsgObject g_sCAN0TxMessage_5C2;
#endif

#if defined(TRANSITIVE_ATTACK)
tCANMsgObject g_sCAN0TxMessage_5A2;
#endif

tCANMsgObject g_sCAN0TxMessage_10;
tCANMsgObject g_sCAN0TxMessage_100;
tCANMsgObject g_sCAN0TxMessage_1000;

//*****************************************************************************
//
// Message Identifiers and Objects
//
//*****************************************************************************

#define RXOBJECT             16
#define RXOBJECT2            15


#define TXOBJECT_5           3

#define TXOBJECT_5A1    4
#define TXOBJECT_5A2    5

#define TXOBJECT_5C1    6
#define TXOBJECT_5C2    7

#define TXOBJECT_10          8


#define TXOBJECT_1000        12

#define TARGET_ID (0xA1)
#define PRECEDED_ID (0xA0)

//---------

#define BITRATE (500000)

#define INTERVAL (600000) /* 5 ms */

#define LATENCY_0B ((44*120000)/(BITRATE/1000)) /* approximately 1 0-byte message transmission time */

#if defined(SYNC_0PHASE)
#define DIFFERENCE ((90*120000)/(BITRATE/1000))
#else
#define DIFFERENCE ((80*120000)/(BITRATE/1000))
#endif

//#define DIFFERENCE ((108*120000)/(BITRATE/1000)) //

#define LATENCY ((96*120000)/(BITRATE/1000))

#define LATENCY_8B_MAX ((129*120000)/(BITRATE/1000)) /* maximum message latency */

//*****************************************************************************
//
// Variables to hold character being sent / reveived
//
//*****************************************************************************

#if defined(RECESSIVE_ATTACK)
uint8_t g_ui8TXMsgData_5A1[2] = { 0xE6, 0x7C };
#else
uint8_t g_ui8TXMsgData_5A1[1] = { 0x66 };
#endif

uint8_t g_ui8TXMsgData_5[1] = { 0x99 };
uint8_t g_ui8TXMsgData_10[6] = { 0xAF, 0xBE, 0xCD, 0xDC, 0xEB, 0xFA };

