Ipsitakoley/tm4c129-canbus/sae-benchmark/can-sae-vc/timers.c
#if defined(SEND_EXTRA)
uint8_t g_ui8TXMsgData_5C1[1] = { 0xC0 };
uint8_t g_ui8TXMsgData_5C2[8] = { 0x01, 0x02, 0x03, 0x04, 0x05, 0x06, 0x07, 0x08 };
#endif

#if defined(TRANSITIVE_ATTACK)
uint8_t g_ui8TXMsgData_5A2[3] = { 0xEE, 0xEE, 0xEE  };
#endif

uint8_t g_ui8TXMsgData_1000[1] = { 0x18 };

int8_t g_ui8RXMsgData[8];

volatile uint32_t g_x;
volatile uint32_t g_y;

//*****************************************************************************
//
// CAN 0 Interrupt Handler. It checks for the cause of the interrupt, and
// maintains a count of all messages that have been transmitted / received
//
//*****************************************************************************
void
CAN0IntHandler(void)
{
    uint32_t ui32Status;

    volatile uint32_t timer_val;


    ROM_IntMasterDisable();

    //
    // Read the CAN interrupt status to find the cause of the interrupt
    //
    // CAN_INT_STS_CAUSE register values
    // 0x0000        = No Interrupt Pending
    // 0x0001-0x0020 = Number of message object that caused the interrupt
    // 0x8000        = Status interrupt
    // all other numbers are reserved and have no meaning in this system
    //
    ui32Status = CANIntStatus(CAN0_BASE, CAN_INT_STS_CAUSE);

    //
    // If this was a status interrupt acknowledge it by reading the CAN
    // controller status register.
    //
    if(ui32Status == CAN_INT_INTID_STATUS)
    {
        //
        // Read the controller status.  This will return a field of status
        // error bits that can indicate various errors. Refer to the
        // API documentation for details about the error status bits.
        // The act of reading this status will clear the interrupt.
        //
        ui32Status = CANStatusGet(CAN0_BASE, CAN_STS_CONTROL);

#if defined(DISABLE_ABORT_TX_ERROR)
        uint8_t lec = ui32Status & CAN_STATUS_LEC_MSK;
        if ( lec == CAN_STATUS_LEC_STUFF || lec == CAN_STATUS_LEC_BIT1 || lec == CAN_STATUS_LEC_BIT0 ) {
            if (g_target_id == TARGET_ID ) {
                CANMessageClear(CAN0_BASE, TXOBJECT_5A1);
            } else {
#if defined(TRANSITIVE_ATTACK)
                CANMessageClear(CAN0_BASE, TXOBJECT_5A2);
#endif
            }
        }
#endif

        //
        // Add ERROR flags to list of current errors. To be handled
        // later, because it would take too much time here in the
        // interrupt.
        //
        g_ui32ErrFlag |= ui32Status;
    } else if(ui32Status == RXOBJECT2) {
        CANIntClear(CAN0_BASE, RXOBJECT2);
        g_bRXFlag = true;
    } else {
        if(ui32Status == RXOBJECT) {
            CANIntClear(CAN0_BASE, RXOBJECT);
            g_bRXFlag = true;
        } else if (ui32Status == TXOBJECT_5) {
            CANIntClear(CAN0_BASE, ui32Status);
            g_bTXFlag_5 = true;
        } else if (ui32Status == TXOBJECT_5A1) {
            CANIntClear(CAN0_BASE, ui32Status);
            g_bTXFlag_5A1 = true;
        } else if (ui32Status == TXOBJECT_5A2) {
            CANIntClear(CAN0_BASE, ui32Status);
            g_bTXFlag = true;
        }
        else {
            CANIntClear(CAN0_BASE, ui32Status);
        }

#if defined(SYNC_0PHASE)
            timer_val = TimerLoadGet(TIMER1_BASE, TIMER_A);
            TimerLoadSet(TIMER1_BASE, TIMER_A, LATENCY);
            ROM_TimerEnable(TIMER1_BASE, TIMER_A);
            if (timer_val == 0) {
                g_msg_since_idle = 0;
            } else {
                g_msg_since_idle++;
            }
#endif

        g_ui32ErrFlag = 0;
    }

    ROM_IntMasterEnable();
}

//****************************************************************************
//
// System clock rate in Hz.
//
//****************************************************************************
uint32_t g_ui32SysClock;

//*****************************************************************************
//
// Flags that contain the current value of the interrupt indicator as displayed
// on the UART.
//
//*****************************************************************************
uint32_t g_ui32Flags;

//*****************************************************************************
//
// The error routine that is called if the driver library encounters an error.
//
//*****************************************************************************
#ifdef DEBUG
void
__error__(char *pcFilename, uint32_t ui32Line)
{
}
#endif

void
send_messages(uint32_t count)
{
    static uint16_t skip_cnt = 0;

    CANMessageSet(CAN0_BASE, TXOBJECT_5, &g_sCAN0TxMessage_5, MSG_OBJ_TYPE_TX);

#if defined(ATTACK)
//uint32_t timer_val = TimerLoadGet(TIMER1_BASE, TIMER_A);
//if (timer_val != 0) {
    if ( count % ATTACK_LATENCY == 0 ) {
        if ( g_sync == 1 && g_reset == 0 ) {
            if ( skip_cnt % g_skip_attack == 0 ) {
               if ( g_target_id == TARGET_ID ) {
                    CANMessageSet(CAN0_BASE, TXOBJECT_5A1, &g_sCAN0TxMessage_5A1, MSG_OBJ_TYPE_TX);
                } else {
#if defined(TRANSITIVE_ATTACK)
                    CANMessageSet(CAN0_BASE, TXOBJECT_5A2, &g_sCAN0TxMessage_5A2, MSG_OBJ_TYPE_TX);
#endif
                }
            }
            ++skip_cnt;
        } else {
            skip_cnt = 0;
        }
    }
//}
#if defined(TRANSITIVE_ATTACK)
    if ( g_target_id == TARGET_ID_2 ) {
        CANMessageSet(CAN0_BASE, TXOBJECT_5A1, &g_sCAN0TxMessage_5A1, MSG_OBJ_TYPE_TX);
    }
#endif

#endif /* ATTACK */

#if defined(SEND_EXTRA)
    if ( count % 2 == 1 ) {
        CANMessageSet(CAN0_BASE, TXOBJECT_5C1, &g_sCAN0TxMessage_5C1, MSG_OBJ_TYPE_TX);
        CANMessageSet(CAN0_BASE, TXOBJECT_5C2, &g_sCAN0TxMessage_5C2, MSG_OBJ_TYPE_TX);
    }
#endif

#if defined(SEND_RESET)
    if ( count % 1000 == 0) {
        UARTprintf("\tRESET\n");
        g_sync = 4;
        g_sync_since_idle = 255;
        g_msg_since_idle = 10;
        g_target_id = TARGET_ID;
        g_skip_attack = SKIP_ATTACK;
        ResetCAN0();
        g_reset = 0;
        CANMessageSet(CAN0_BASE, TXOBJECT_100, &g_sCAN0TxMessage_100, MSG_OBJ_TYPE_TX);
    }
#endif



